
## :white_check_mark: Apply Succeeded (push-server-cdk-dev)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/44071)



<pre><code>Apply complete! Resources: 21 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
data.aws_caller_identity.caller: Reading...
data.aws_region.region: Reading...
data.aws_ssm_parameter.application_pocket_vpc_vpc_ssm_param_DD9C7A4F: Reading...
data.aws_kms_alias.kms_alias: Reading...
data.aws_ssm_parameter.application_pocket_vpc_public_subnets_282A59F4: Reading...
data.aws_sqs_queue.job-queue: Reading...
data.aws_caller_identity.application_pocket_vpc_current_identity_0A422301: Reading...
data.aws_kms_alias.application_pocket_vpc_secrets_manager_key_2C3C8766: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs-iam_ecs-task-assume_05903663: Reading...
data.aws_region.region: Read complete after 0s [id=us-east-1]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_ecs-task-assume_05903663: Read complete after 0s [id=1077804475]
data.aws_caller_identity.caller: Read complete after 0s [id=410318598490]
data.aws_ssm_parameter.application_pocket_vpc_private_subnets_424C83F8: Reading...
data.aws_caller_identity.application_pocket_vpc_current_identity_0A422301: Read complete after 0s [id=410318598490]
data.aws_sqs_queue.token-queue: Reading...
data.aws_sns_topic.backend_notifications: Reading...
data.aws_region.application_pocket_vpc_current_region_7774DA97: Reading...
data.aws_region.application_pocket_vpc_current_region_7774DA97: Read complete after 0s [id=us-east-1]
data.aws_ssm_parameter.application_pocket_vpc_public_subnets_282A59F4: Read complete after 0s [id=/Shared/PublicSubnets]
data.aws_ssm_parameter.application_pocket_vpc_vpc_ssm_param_DD9C7A4F: Read complete after 0s [id=/Shared/Vpc]
data.aws_ssm_parameter.application_pocket_vpc_private_subnets_424C83F8: Read complete after 0s [id=/Shared/PrivateSubnets]
data.aws_kms_alias.kms_alias: Read complete after 0s [id=arn:aws:kms:us-east-1:410318598490:alias/aws/secretsmanager]
data.aws_kms_alias.application_pocket_vpc_secrets_manager_key_2C3C8766: Read complete after 0s [id=arn:aws:kms:us-east-1:410318598490:alias/aws/secretsmanager]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-execution-role-policy_015FDEBA: Reading...
data.aws_vpc.application_pocket_vpc_22D55D83: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-execution-role-policy_015FDEBA: Read complete after 0s [id=1038169679]
data.aws_sqs_queue.job-queue: Read complete after 0s [id=https://sqs.us-east-1.amazonaws.com/410318598490/pocket-push-queue]
data.aws_sqs_queue.token-queue: Read complete after 1s [id=https://sqs.us-east-1.amazonaws.com/410318598490/pocket-push-feedback-queue]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-role-policy_090CC3AD: Reading...
data.aws_sns_topic.backend_notifications: Read complete after 1s [id=arn:aws:sns:us-east-1:410318598490:Backend-Dev-ChatBot]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-role-policy_090CC3AD: Read complete after 0s [id=1745999932]
data.aws_vpc.application_pocket_vpc_22D55D83: Read complete after 1s [id=vpc-012481e83ffa5e152]
data.aws_security_groups.application_pocket_vpc_internal_security_groups_8D057D72: Reading...
data.aws_security_groups.application_pocket_vpc_default_security_groups_4D3B6986: Reading...
data.aws_subnets.application_pocket_vpc_public_subnet_ids_4577655C: Reading...
data.aws_subnets.application_pocket_vpc_private_subnet_ids_AED9F181: Reading...
data.aws_security_groups.application_pocket_vpc_default_security_groups_4D3B6986: Read complete after 0s [id=us-east-1]
data.aws_security_groups.application_pocket_vpc_internal_security_groups_8D057D72: Read complete after 0s [id=us-east-1]
data.aws_subnets.application_pocket_vpc_private_subnet_ids_AED9F181: Read complete after 0s [id=us-east-1]
data.aws_subnets.application_pocket_vpc_public_subnet_ids_4577655C: Read complete after 0s [id=us-east-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_appautoscaling_policy.application_autoscaling_scale_in_policy_BF273511 will be created
  + resource "aws_appautoscaling_policy" "application_autoscaling_scale_in_policy_BF273511" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "Push-Dev-ScaleInPolicy"
      + policy_type        = "StepScaling"
      + resource_id        = "service/Push-Dev/Push-Dev"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + step_scaling_policy_configuration {
          + adjustment_type         = "ChangeInCapacity"
          + cooldown                = 60
          + metric_aggregation_type = "Average"

          + step_adjustment {
              + metric_interval_upper_bound = "0"
              + scaling_adjustment          = -1
            }
        }
    }

  # aws_appautoscaling_policy.application_autoscaling_scale_out_policy_D03900A2 will be created
  + resource "aws_appautoscaling_policy" "application_autoscaling_scale_out_policy_D03900A2" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "Push-Dev-ScaleOutPolicy"
      + policy_type        = "StepScaling"
      + resource_id        = "service/Push-Dev/Push-Dev"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + step_scaling_policy_configuration {
          + adjustment_type         = "ChangeInCapacity"
          + cooldown                = 60
          + metric_aggregation_type = "Average"

          + step_adjustment {
              + metric_interval_lower_bound = "0"
              + scaling_adjustment          = 2
            }
        }
    }

  # aws_appautoscaling_target.application_autoscaling_autoscaling_target_42BF5C99 will be created
  + resource "aws_appautoscaling_target" "application_autoscaling_autoscaling_target_42BF5C99" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 10
      + min_capacity       = 2
      + resource_id        = "service/Push-Dev/Push-Dev"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
      + tags_all           = (known after apply)
    }

  # aws_cloudwatch_dashboard.application_cloudwatch-dashboard_1F3DC0ED will be created
  + resource "aws_cloudwatch_dashboard" "application_cloudwatch-dashboard_1F3DC0ED" {
      + dashboard_arn  = (known after apply)
      + dashboard_body = jsonencode(
            {
              + widgets = [
                  + {
                      + height     = 6
                      + properties = {
                          + annotations = {
                              + horizontal = [
                                  + {
                                      + color = "#e377c2"
                                      + label = "CPU scale out"
                                      + value = 45
                                    },
                                  + {
                                      + color = "#c5b0d5"
                                      + label = "CPU scale in"
                                      + value = 30
                                    },
                                ]
                            }
                          + metrics     = [
                              + [
                                  + "ECS/ContainerInsights",
                                  + "RunningTaskCount",
                                  + "ServiceName",
                                  + "Push-Dev",
                                  + "ClusterName",
                                  + "Push-Dev",
                                  + {
                                      + color = "#c49c94"
                                      + yAxis = "right"
                                    },
                                ],
                              + [
                                  + "AWS/ECS",
                                  + "CPUUtilization",
                                  + ".",
                                  + ".",
                                  + ".",
                                  + ".",
                                  + {
                                      + color = "#f7b6d2"
                                    },
                                ],
                              + [
                                  + ".",
                                  + "MemoryUtilization",
                                  + ".",
                                  + ".",
                                  + ".",
                                  + ".",
                                  + {
                                      + color = "#c7c7c7"
                                    },
                                ],
                            ]
                          + period      = 60
                          + region      = "us-east-1"
                          + stacked     = false
                          + stat        = "Average"
                          + title       = "Service Load"
                          + view        = "timeSeries"
                        }
                      + type       = "metric"
                      + width      = 12
                      + x          = 0
                      + y          = 6
                    },
                ]
            }
        )
      + dashboard_name = "Push-Dev"
      + id             = (known after apply)
    }

  # aws_cloudwatch_log_group.app-log-group will be created
  + resource "aws_cloudwatch_log_group" "app-log-group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/Backend/Push-Dev/ecs/app"
      + name_prefix       = (known after apply)
      + retention_in_days = 90
      + skip_destroy      = true
      + tags              = {
          + "environment" = "Dev"
          + "service"     = "Push"
        }
      + tags_all          = {
          + "environment" = "Dev"
          + "service"     = "Push"
        }
    }

  # aws_cloudwatch_log_group.aws-otel-collector-log-group will be created
  + resource "aws_cloudwatch_log_group" "aws-otel-collector-log-group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/Backend/Push-Dev/ecs/aws-otel-collector"
      + name_prefix       = (known after apply)
      + retention_in_days = 90
      + skip_destroy      = true
      + tags              = {
          + "environment" = "Dev"
          + "service"     = "Push"
        }
      + tags_all          = {
          + "environment" = "Dev"
          + "service"     = "Push"
        }
    }

  # aws_cloudwatch_metric_alarm.application_autoscaling_scale_in_alarm_850BE3A1 will be created
  + resource "aws_cloudwatch_metric_alarm" "application_autoscaling_scale_in_alarm_850BE3A1" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alarm to reduce capacity if container CPU is low"
      + alarm_name                            = "Push-Dev Service Low CPU"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + dimensions                            = {
          + "ClusterName" = "Push-Dev"
          + "ServiceName" = "Push-Dev"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ECS"
      + period                                = 60
      + statistic                             = "Average"
      + tags                                  = {
          + "environment" = "Dev"
          + "service"     = "Push"
        }
      + tags_all                              = {
          + "environment" = "Dev"
          + "service"     = "Push"
        }
      + threshold                             = 30
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.application_autoscaling_scale_out_alarm_E40FCBA0 will be created
  + resource "aws_cloudwatch_metric_alarm" "application_autoscaling_scale_out_alarm_E40FCBA0" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alarm to add capacity if container CPU is high"
      + alarm_name                            = "Push-Dev Service High CPU"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "ClusterName" = "Push-Dev"
          + "ServiceName" = "Push-Dev"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ECS"
      + period                                = 60
      + statistic                             = "Average"
      + tags                                  = {
          + "environment" = "Dev"
          + "service"     = "Push"
        }
      + tags_all                              = {
          + "environment" = "Dev"
          + "service"     = "Push"
        }
      + threshold                             = 45
      + treat_missing_data                    = "notBreaching"
    }

  # aws_ecr_lifecycle_policy.application_ecs_service_ecr-app_ecr-repo-lifecyclepolicy_CCDF75B7 will be created
  + resource "aws_ecr_lifecycle_policy" "application_ecs_service_ecr-app_ecr-repo-lifecyclepolicy_CCDF75B7" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "expire old images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 800
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "push-dev-app"
    }

  # aws_ecr_repository.application_ecs_service_ecr-app_ecr-repo_ABFE17F0 will be created
  + resource "aws_ecr_repository" "application_ecs_service_ecr-app_ecr-repo_ABFE17F0" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "push-dev-app"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "environment" = "Dev"
          + "service"     = "Push"
        }
      + tags_all             = {
          + "environment" = "Dev"
          + "service"     = "Push"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecs_cluster.application_ecs_cluster_4DC6EFB3 will be created
  + resource "aws_ecs_cluster" "application_ecs_cluster_4DC6EFB3" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "Push-Dev"
      + tags     = {
          + "environment" = "Dev"
          + "service"     = "Push"
        }
      + tags_all = {
          + "environment" = "Dev"
          + "service"     = "Push"
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # aws_ecs_service.application_ecs_service_ecs-service_A8BAB5F4 will be created
  + resource "aws_ecs_service" "application_ecs_service_ecs-service_A8BAB5F4" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "Push-Dev"
      + platform_version                   = (known after apply)
      + propagate_tags                     = "SERVICE"
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "environment" = "Dev"
          + "service"     = "Push"
        }
      + tags_all                           = {
          + "environment" = "Dev"
          + "service"     = "Push"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + deployment_controller {
          + type = "ECS"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = [
              + "subnet-04478ac1c55709b1f",
              + "subnet-07854aac95d07bb16",
              + "subnet-0a6c00fa564f97b10",
              + "subnet-0eb99fe10e08d5d96",
            ]
        }
    }

  # aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4 will be created
  + resource "aws_ecs_task_definition" "application_ecs_service_ecs-task_461CC9D4" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "512"
      + execution_role_arn       = (known after apply)
      + family                   = "Push-Dev"
      + id                       = (known after apply)
      + memory                   = "2048"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = true
      + tags                     = {
          + "environment" = "Dev"
          + "service"     = "Push"
        }
      + tags_all                 = {
          + "environment" = "Dev"
          + "service"     = "Push"
        }
      + task_role_arn            = (known after apply)
    }

  # aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-execution-role-policy_2D469A77 will be created
  + resource "aws_iam_policy" "application_ecs_service_ecs-iam_ecs-task-execution-role-policy_2D469A77" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "Push-Dev-TaskExecutionRolePolicy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "secretsmanager:GetSecretValue",
                          + "kms:Decrypt",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:secretsmanager:us-east-1:410318598490:secret:Shared/*",
                          + "arn:aws:secretsmanager:us-east-1:410318598490:secret:Shared",
                          + "arn:aws:secretsmanager:us-east-1:410318598490:secret:Push/Dev/*",
                          + "arn:aws:secretsmanager:us-east-1:410318598490:secret:Push/Dev",
                          + "arn:aws:secretsmanager:us-east-1:410318598490:secret:Push-Dev/*",
                          + "arn:aws:secretsmanager:us-east-1:410318598490:secret:Push-Dev",
                          + "arn:aws:kms:us-east-1:410318598490:key/379b8bf2-3daf-4927-b40e-39744689d73f",
                        ]
                    },
                  + {
                      + Action   = "ssm:GetParameter*"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ssm:us-east-1:410318598490:parameter/Push/Dev/*",
                          + "arn:aws:ssm:us-east-1:410318598490:parameter/Push/Dev",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "environment" = "Dev"
          + "service"     = "Push"
        }
      + tags_all    = {
          + "environment" = "Dev"
          + "service"     = "Push"
        }
    }

  # aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6 will be created
  + resource "aws_iam_policy" "application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "Push-Dev-TaskRolePolicy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "xray:PutTraceSegments",
                          + "xray:PutTelemetryRecords",
                          + "xray:GetSamplingTargets",
                          + "xray:GetSamplingStatisticSummaries",
                          + "xray:GetSamplingRules",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "sqs:SendMessageBatch",
                          + "sqs:SendMessage",
                          + "sqs:ReceiveMessage",
                          + "sqs:DeleteMessage",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:sqs:us-east-1:410318598490:pocket-push-queue",
                          + "arn:aws:sqs:us-east-1:410318598490:pocket-push-feedback-queue",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "environment" = "Dev"
          + "service"     = "Push"
        }
      + tags_all    = {
          + "environment" = "Dev"
          + "service"     = "Push"
        }
    }

  # aws_iam_role.application_ecs_service_ecs-iam_ecs-execution-role_FB754BAA will be created
  + resource "aws_iam_role" "application_ecs_service_ecs-iam_ecs-execution-role_FB754BAA" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "Push-Dev-TaskExecutionRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "environment" = "Dev"
          + "service"     = "Push"
        }
      + tags_all              = {
          + "environment" = "Dev"
          + "service"     = "Push"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role.application_ecs_service_ecs-iam_ecs-task-role_A72990ED will be created
  + resource "aws_iam_role" "application_ecs_service_ecs-iam_ecs-task-role_A72990ED" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "Push-Dev-TaskRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "environment" = "Dev"
          + "service"     = "Push"
        }
      + tags_all              = {
          + "environment" = "Dev"
          + "service"     = "Push"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-custom-attachment_F8DDD355 will be created
  + resource "aws_iam_role_policy_attachment" "application_ecs_service_ecs-iam_ecs-task-custom-attachment_F8DDD355" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-custom-attachment_046B7E2E will be created
  + resource "aws_iam_role_policy_attachment" "application_ecs_service_ecs-iam_ecs-task-execution-custom-attachment_046B7E2E" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-default-attachment_99A621FF will be created
  + resource "aws_iam_role_policy_attachment" "application_ecs_service_ecs-iam_ecs-task-execution-default-attachment_99A621FF" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = (known after apply)
    }

  # aws_security_group.application_ecs_service_ecs_security_group_231C6B1E will be created
  + resource "aws_security_group" "application_ecs_service_ecs_security_group_231C6B1E" {
      + arn                    = (known after apply)
      + description            = "Internal ECS Security Group (Managed by Terraform)"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "required"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = []
      + name                   = (known after apply)
      + name_prefix            = "Push-Dev-ECSSecurityGroup"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "environment" = "Dev"
          + "service"     = "Push"
        }
      + tags_all               = {
          + "environment" = "Dev"
          + "service"     = "Push"
        }
      + vpc_id                 = "vpc-012481e83ffa5e152"
    }

Plan: 21 to add, 0 to change, 0 to destroy.
aws_cloudwatch_log_group.app-log-group: Creating...
aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-execution-role-policy_2D469A77: Creating...
aws_ecs_cluster.application_ecs_cluster_4DC6EFB3: Creating...
aws_cloudwatch_log_group.aws-otel-collector-log-group: Creating...
aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6: Creating...
aws_ecr_repository.application_ecs_service_ecr-app_ecr-repo_ABFE17F0: Creating...
aws_security_group.application_ecs_service_ecs_security_group_231C6B1E: Creating...
aws_iam_role.application_ecs_service_ecs-iam_ecs-execution-role_FB754BAA: Creating...
aws_iam_role.application_ecs_service_ecs-iam_ecs-task-role_A72990ED: Creating...
aws_cloudwatch_log_group.aws-otel-collector-log-group: Creation complete after 0s [id=/Backend/Push-Dev/ecs/aws-otel-collector]
aws_cloudwatch_log_group.app-log-group: Creation complete after 0s [id=/Backend/Push-Dev/ecs/app]
aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-execution-role-policy_2D469A77: Creation complete after 0s [id=arn:aws:iam::410318598490:policy/Push-Dev-TaskExecutionRolePolicy]
aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6: Creation complete after 0s [id=arn:aws:iam::410318598490:policy/Push-Dev-TaskRolePolicy]
aws_iam_role.application_ecs_service_ecs-iam_ecs-task-role_A72990ED: Creation complete after 0s [id=Push-Dev-TaskRole]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-custom-attachment_F8DDD355: Creating...
aws_iam_role.application_ecs_service_ecs-iam_ecs-execution-role_FB754BAA: Creation complete after 0s [id=Push-Dev-TaskExecutionRole]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-default-attachment_99A621FF: Creating...
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-custom-attachment_046B7E2E: Creating...
aws_ecr_repository.application_ecs_service_ecr-app_ecr-repo_ABFE17F0: Creation complete after 0s [id=push-dev-app]
aws_ecr_lifecycle_policy.application_ecs_service_ecr-app_ecr-repo-lifecyclepolicy_CCDF75B7: Creating...
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Creating...
aws_ecr_lifecycle_policy.application_ecs_service_ecr-app_ecr-repo-lifecyclepolicy_CCDF75B7: Creation complete after 0s [id=push-dev-app]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-custom-attachment_F8DDD355: Creation complete after 0s [id=Push-Dev-TaskRole-20240208190528897600000002]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-custom-attachment_046B7E2E: Creation complete after 0s [id=Push-Dev-TaskExecutionRole-20240208190528903900000003]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-default-attachment_99A621FF: Creation complete after 0s [id=Push-Dev-TaskExecutionRole-20240208190528909800000004]
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Creation complete after 0s [id=Push-Dev]
aws_security_group.application_ecs_service_ecs_security_group_231C6B1E: Creation complete after 2s [id=sg-0e5ea7bf00db42e11]
aws_ecs_cluster.application_ecs_cluster_4DC6EFB3: Still creating... [10s elapsed]
aws_ecs_cluster.application_ecs_cluster_4DC6EFB3: Creation complete after 10s [id=arn:aws:ecs:us-east-1:410318598490:cluster/Push-Dev]
aws_ecs_service.application_ecs_service_ecs-service_A8BAB5F4: Creating...
aws_ecs_service.application_ecs_service_ecs-service_A8BAB5F4: Creation complete after 1s [id=arn:aws:ecs:us-east-1:410318598490:service/Push-Dev/Push-Dev]
aws_appautoscaling_target.application_autoscaling_autoscaling_target_42BF5C99: Creating...
aws_cloudwatch_dashboard.application_cloudwatch-dashboard_1F3DC0ED: Creating...
aws_cloudwatch_dashboard.application_cloudwatch-dashboard_1F3DC0ED: Creation complete after 0s [id=Push-Dev]
aws_appautoscaling_target.application_autoscaling_autoscaling_target_42BF5C99: Creation complete after 0s [id=service/Push-Dev/Push-Dev]
aws_appautoscaling_policy.application_autoscaling_scale_out_policy_D03900A2: Creating...
aws_appautoscaling_policy.application_autoscaling_scale_in_policy_BF273511: Creating...
aws_appautoscaling_policy.application_autoscaling_scale_out_policy_D03900A2: Creation complete after 0s [id=Push-Dev-ScaleOutPolicy]
aws_cloudwatch_metric_alarm.application_autoscaling_scale_out_alarm_E40FCBA0: Creating...
aws_appautoscaling_policy.application_autoscaling_scale_in_policy_BF273511: Creation complete after 0s [id=Push-Dev-ScaleInPolicy]
aws_cloudwatch_metric_alarm.application_autoscaling_scale_in_alarm_850BE3A1: Creating...
aws_cloudwatch_metric_alarm.application_autoscaling_scale_out_alarm_E40FCBA0: Creation complete after 0s [id=Push-Dev Service High CPU]
aws_cloudwatch_metric_alarm.application_autoscaling_scale_in_alarm_850BE3A1: Creation complete after 0s [id=Push-Dev Service Low CPU]

Apply complete! Resources: 21 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobID":"d2c5372e-898f-49fd-b205-84a70497b5ea","JobName":"push-server_infrastructure_apply_dev","PRNumber":157,"Program":"tfcmt","SHA1":"f7b4c25cfc24900d37bc3c93a6da8a3bbc79d9be","Target":"push-server-cdk-dev","Vars":{}} -->